<template>
  <section class="question">
    <div class="container">
      <div class="question__content">
        <div class="question__img">
          <img src="/src/assets/Question/question.png" alt="" />
        </div>
        <div class="question__info">
          <h2>Вопросы и ответы</h2>
          <QuestionItem v-for="item in items" :key="item.title" :title="item.title" :description="item.description" />
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
import QuestionItem from './QuestionItem.vue'

const items = [
  {
    id: 0,
    title: 'Что такое доверенность?',
    description:
      'Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему. Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.',
  },
  {
    id: 1,
    title: 'Что нужно для обеспечения доказательства?',
    description:
      'Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему. Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.',
  },
  {
    id: 2,
    title: 'На какой срок и когда выдается Свидетельство о праве на наследство?',
    description:
      'Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему. Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.',
  },
  {
    id: 3,
    title: 'На какой срок можно сделать Доверенность на управление и распоряжение имуществом?',
    description:
      'Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему. Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.',
  },
]
</script>

<style lang="scss">
@import "../../assets/scss/variables.scss";
.question {
  &__content {
    display: flex;
    justify-content: space-between;
    margin-bottom: 120px;
  }

  &__info {
    width: 60%;

    h2 {
      font-weight: 600;
      font-size: 36px;
      color:$text-dark-blue;
    }
  }
}
</style>
